#!/usr/bin/env python
# coding: utf-8

# In[2]:


# symbol dictionary
sd = {'½': '이분의일',
 '□': '사각형',
 '＞': '보다크다',
 '㈏': '나',
 '(': '',
 '×': '곱하기',
 ')': '',
 '①': '일번',
 '+': '더하기',
 '˚': '도',
 '⑤': '오번',
 '⅓': '삼분의일',
 '⅔': '삼분의이',
 '¼': '사분의일',
 '′': '',
 '＜': '보다작다',
 '-': '빼기',
 '!': '',
 '④': '사번',
 'π': '파이',
 '㎞': '킬로미터',
 '=': '는',
 ':': '대',
 '~': '',
 '…': '',
 '△': '삼각형',
 '²': '의제곱',
 '②': '이번',
 '㈎': '가',
 '≤': '보다크거나같다',
 '㎝': '센치미터',
 '|': '절대값',
 '㈐': '다',
 '＝': '는',
 '÷': '나누기',
 '⑵': '이번',
 '㎠': '제곱센치미터',
 '¾': '사분의삼',
 '∠': '각',
 '%': '퍼센트',
 '－': '마이너스',
 "'": '',
 '③': '삼번',
 '＋': '더하기',
 '⑴': '일번',
 '√': '루트',
 'cos': '코사인',
 'sin': '사인',
 'tan': '탄젠트'}


# In[3]:


ad = {
    'A':'에이',
    'B':'비',
    'C':'씨',
    'D':'디',
    'E':'이',
    'F':'에프',
    'G':'지',
    'H':'에이치',
    'I':'아이',
    'J':'제이',
    'K':'케이',
    'L':'엘',
    'M':'엠',
    'N':'엔',
    'O':'오',
    'P':'피',
    'Q':'큐',
    'R':'알',
    'S':'에스',
    'T':'티',
    'U':'유',
    'V':'브이',
    'W':'더블유',
    'X':'엑스',
    'Y':'와이',
    'Z':'지'
}


# In[11]:


def get_korean_pronunciation_of_number(n):
    nbased = {0 : '', 1 : '일', 2 : '이', 3 : '삼', 4 : '사', 5 : '오', 6 : '육', 7 : '칠', 8 : '팔', 9 : '구' }
    nkopro = {}
    for _ in range(n+1):
        t = _//1000
        h = (_%1000)//100
        d = (_%100)//10
        o = _%10

        if _ == 0:
            nkopro[_] = '영'
        else:
            tt = '' if t == 0 else ('천' if t == 1 else nbased[t] + '천')
            hh = '' if h == 0 else ('백' if h == 1 else nbased[h] + '백')
            dd = '' if d == 0 else ('십' if d == 1 else nbased[d] + '십')
            oo = '' if o == 0 else nbased[o]
            nkopro[_] = tt+hh+dd+oo
            
    return nkopro


# In[12]:


kopro = get_korean_pronunciation_of_number(9999) #~9999

